# 0.0. Importações

In [1]:
import pandas as pd

## 0.1. Carregar Dados

In [3]:
data = pd.read_csv( 'data/kc_house_data.csv.zip' )

# 1.0. Tipos de Dados

## 1.1. Identificar tipos de dados

In [4]:
print( data.dtypes )

id                 int64
date              object
price            float64
bedrooms           int64
bathrooms        float64
sqft_living        int64
sqft_lot           int64
floors           float64
waterfront         int64
view               int64
condition          int64
grade              int64
sqft_above       float64
sqft_basement      int64
yr_built           int64
yr_renovated       int64
zipcode            int64
lat              float64
long             float64
sqft_living15      int64
sqft_lot15         int64
dtype: object

## 1.2. Converter tipos de dados

In [5]:
# funcao que converte de object (string) -> date
data['date'] = pd.to_datetime( data['date'] )

print( data.dtypes )

id                        int64
date             datetime64[ns]
price                   float64
bedrooms                  int64
bathrooms               float64
sqft_living               int64
sqft_lot                  int64
floors                  float64
waterfront                int64
view                      int64
condition                 int64
grade                     int64
sqft_above              float64
sqft_basement             int64
yr_built                  int64
yr_renovated              int64
zipcode                   int64
lat                     float64
long                    float64
sqft_living15             int64
sqft_lot15                int64
dtype: object

In [6]:
# funcao que converte de float64 -> int64
data['bathrooms'] = data['bathrooms'].astype( 'int64' )

print( data.dtypes )

id                        int64
date             datetime64[ns]
price                   float64
bedrooms                  int64
bathrooms                 int64
sqft_living               int64
sqft_lot                  int64
floors                  float64
waterfront                int64
view                      int64
condition                 int64
grade                     int64
sqft_above              float64
sqft_basement             int64
yr_built                  int64
yr_renovated              int64
zipcode                   int64
lat                     float64
long                    float64
sqft_living15             int64
sqft_lot15                int64
dtype: object

## 2.0. Manipulação de Dados

## 2.1. Criar Colunas

In [7]:
data['meu_nome'] = 'Cid'
data['numero_aleatorio'] = 60

data.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15,meu_nome,numero_aleatorio
0,7129300520,2014-10-13,221900.0,3,1,1180,5650,1.0,0,0,...,0,1955,0,98178,47.5112,-122.257,1340,5650,Cid,60
1,6414100192,2014-12-09,538000.0,3,2,2570,7242,2.0,0,0,...,400,1951,1991,98125,47.7210,-122.319,1690,7639,Cid,60
2,5631500400,2015-02-25,180000.0,2,1,770,10000,1.0,0,0,...,0,1933,0,98028,47.7379,-122.233,2720,8062,Cid,60
3,2487200875,2014-12-09,604000.0,4,3,1960,5000,1.0,0,0,...,910,1965,0,98136,47.5208,-122.393,1360,5000,Cid,60
4,1954400510,2015-02-18,510000.0,3,2,1680,8080,1.0,0,0,...,0,1987,0,98074,47.6168,-122.045,1800,7503,Cid,60

## 2.2. Deletar Colunas

In [8]:
data = data.drop( ['meu_nome', 'numero_aleatorio'], axis=1 )

data.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,2014-10-13,221900.0,3,1,1180,5650,1.0,0,0,...,7,1180.0,0,1955,0,98178,47.5112,-122.257,1340,5650
1,6414100192,2014-12-09,538000.0,3,2,2570,7242,2.0,0,0,...,7,2170.0,400,1951,1991,98125,47.7210,-122.319,1690,7639
2,5631500400,2015-02-25,180000.0,2,1,770,10000,1.0,0,0,...,6,770.0,0,1933,0,98028,47.7379,-122.233,2720,8062
3,2487200875,2014-12-09,604000.0,4,3,1960,5000,1.0,0,0,...,7,1050.0,910,1965,0,98136,47.5208,-122.393,1360,5000
4,1954400510,2015-02-18,510000.0,3,2,1680,8080,1.0,0,0,...,8,1680.0,0,1987,0,98074,47.6168,-122.045,1800,7503

## 2.3. Selecionar dados

### 2.3.1. Forma 1: direto nomes das colunas

In [19]:
data[['id', 'date', 'price', 'bedrooms', 'bathrooms']].head()

           id       date     price  bedrooms  bathrooms
0  7129300520 2014-10-13  221900.0         3       1.00
1  6414100192 2014-12-09  538000.0         3       2.25
2  5631500400 2015-02-25  180000.0         2       1.00
3  2487200875 2014-12-09  604000.0         4       3.00
4  1954400510 2015-02-18  510000.0         3       2.00

### 2.3.2. Forma 2: Pelos indices das linhas e colunas

*data[ linhas, colunas ]*

In [26]:
# Selecionar para mim: 
# da linha 0 até linha 10
# da coluna 0 até 3

# data[0:10, 0:3]

data.iloc[0:10, 0:3]

           id       date      price
0  7129300520 2014-10-13   221900.0
1  6414100192 2014-12-09   538000.0
2  5631500400 2015-02-25   180000.0
3  2487200875 2014-12-09   604000.0
4  1954400510 2015-02-18   510000.0
5  7237550310 2014-05-12  1225000.0
6  1321400060 2014-06-27   257500.0
7  2008000270 2015-01-15   291850.0
8  2414600126 2015-04-15   229500.0
9  3793500160 2015-03-12   323000.0

### 2.3.3. Forma 3: Pelos **INDICES** das linhas e **NOMES** das colunas

*data[ linhas_**indice**, colunas_**nomes** ]*

In [27]:
# Selecionar para mim: 
# da linha 0 até linha 10
# da coluna 0 até 3

data.loc[ 0:10, ['id', 'date', 'price'] ]

            id       date      price
0   7129300520 2014-10-13   221900.0
1   6414100192 2014-12-09   538000.0
2   5631500400 2015-02-25   180000.0
3   2487200875 2014-12-09   604000.0
4   1954400510 2015-02-18   510000.0
5   7237550310 2014-05-12  1225000.0
6   1321400060 2014-06-27   257500.0
7   2008000270 2015-01-15   291850.0
8   2414600126 2015-04-15   229500.0
9   3793500160 2015-03-12   323000.0
10  1736800520 2015-04-03   662500.0

### 2.3.4. Forma 4: Pelos **INDICES** das linhas e **NOMES** das colunas

*data[ linhas_**indice**, colunas_**booleans** ]*

In [43]:
print( data.columns )
cols_bool = [True, False, True, False, True,True, False, True, False, True,True, False, True, False, True,True, False, True, False, True, True]

print( data.loc[0:10, cols_bool ] )

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'grade',
       'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode',
       'lat', 'long', 'sqft_living15', 'sqft_lot15'],
      dtype='object')
            id      price  bathrooms  ...      lat  sqft_living15  sqft_lot15
0   7129300520   221900.0          1  ...  47.5112           1340        5650
1   6414100192   538000.0          2  ...  47.7210           1690        7639
2   5631500400   180000.0          1  ...  47.7379           2720        8062
3   2487200875   604000.0          3  ...  47.5208           1360        5000
4   1954400510   510000.0          2  ...  47.6168           1800        7503
5   7237550310  1225000.0          4  ...  47.6561           4760      101930
6   1321400060   257500.0          2  ...  47.3097           2238        6819
7   2008000270   291850.0          1  ...  47.4095           1650        9711
8   2414600126   229500.0          1  ...  47.5123           1780        8113
9   3793500160   323000.0          2  ...  47.3684           2390        7570
10  1736800520   662500.0          2  ...  47.6007           2210        8925

[11 rows x 13 columns]

# Aula

## **Novas Perguntas de Negocio**

1. Qual a data do Imovéis mais antigo no portfólio?

2. Quantos imovéis possuem o número máximo de andares?

3. Criar uma classificação para os imóveis, separando-os em baixo e alto padrão, de acordo com preço.
* acima de R$ 540.000 -> alto padrão.
* abaixo de 540.00 -> baixo padrão.

4. Gostaria de uma relatório ordenado pelo preço e contendo as seguintes informações:
* id do imovel,
* data que o imvel ficou disponível para compra,
* números de quartos,
* tamanho total do terreno,
* o preço.
* Classificação do imóvel (alto e baixo padrao)

5. Gostaria de um Mapa indicando onde as casas estão localizadas geograficamente.

## Produto Final (o que será entregue)
- Email + 2 anexos
    - email:
        - texto: perguntas | respostas
    - anexo:
        - Um relatório em .csv
        - a foto de um mapa html.

### 1. Qual a data do Imovéis mais antigo no portfólio?

# Exercicios